'''          CODE BY  𐏓꯭  𝗦𝗞ᬊ͜͡  𝗛𝗔𝗞𝗘𝗥〆͎          '''

from colors import Colors

def print_banner():
    Colors.typing_effect2('''\n\n
      ⠛⠛⣿⣿⣿⣿⣿⡷⢶⣦⣶⣶⣤⣤⣤⣀   
         ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⡀ 
         ⠉⠉⠉⠙⠻⣿⣿⠿⠿⠛⠛⠛⠻⣿⣿⣇    𝗪𝗛𝗔𝗧𝗦𝗔𝗣𝗣
        ⢤⣀⣀⣀  ⢸⣷⡄ ⣁⣀⣤⣴⣿⣿⣿⣆    𝗕𝗔𝗡𝗡𝗜𝗡𝗚
          ⠹⠏   ⣿⣧ ⠹⣿⣿⣿⣿⣿⡿⣿    𝗧𝗢𝗢𝗟 𝗩𝟭
               ⠛⠿⠇⢀⣼⣿⣿⠛⢯⡿⡟
                ⠦⠴⢿⢿⣿⡿⠷ ⣿ 
             ⠙⣷⣶⣶⣤⣤⣤⣤⣤⣶⣦⠃ 
             ⢐⣿⣾⣿⣿⣿⣿⣿⣿⣿⣿  
             ⠈⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇  
               ⠙⠻⢿⣿⣿⣿⣿⠟⠁
    ''', Colors.CYAN + Colors.BOLD)

def print_code_by_𝗦𝗞():
    Colors.typing_effect("\n  POWERED BY 𝗦𝗞 𝗛𝗔𝗖𝗞𝗘𝗥 9T9\n\n", Colors.WHITE + Colors.BOLD)
